//******************************************************************************
//               ЗАГОЛОВОЧНЫЙ ФАЙЛ БИБЛИОТЕКИ GSM МОДУЛЯ
//******************************************************************************

//**************Подключаемые файлы**********************************************
#include "stm32f10x.h"

//**************Макроопределения************************************************
#define GSM_MOD GPIOA

#define GSM_ON GPIO_Pin_8
#define GSM_RESET GPIO_Pin_11
#define GSM_READY GPIO_Pin_12

#define GSM_RING GPIO_Pin_9

#define Beeline_OP 1
#define MTS_OP 2
#define Megafon_OP 3


//**************Определение собственных типов***********************************

//**************Глобальные переменные доступные из других файлов****************

//*************Объявление испльзуемых функций***********************************
void GSM_Configuration(void); //Инициализация GSM
/***************************КОНЕЦ ФАЙЛА****************************************/