//******************************************************************************
//              ОСНОВНОЙ ЗАГОЛОВОЧНЫЙ ФАЙЛ ПРОЕКТА
//******************************************************************************

//**************Подключаемые файлы**********************************************
#include "stm32f10x.h"

//**************Макроопределения************************************************


//**************Определение собственных типов***********************************

//**************Глобальные переменные доступные из других файлов****************
extern uint16_t max[8-1], min[8-1], timmin[8-1];
extern uint32_t error;
extern uint8_t index;
extern uint16_t typ_pin[13-1];
//*************Объявление испльзуемых функций***********************************
void Dathiki(void);
void Temperature(uint16_t temp); //функция сигнализации минимальной температуры
/***************************КОНЕЦ ФАЙЛА****************************************/